Model: "BOT-NET-RoBERTa-transformer.h5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 779)]             0         
_________________________________________________________________
dense (Dense)                (None, 779)               607620    
_________________________________________________________________
batch_normalization (BatchNo (None, 779)               3116      
_________________________________________________________________
activation_10 (Activation)   (None, 779)               0         
_________________________________________________________________
dropout (Dropout)            (None, 779)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 128)               99840     
_________________________________________________________________
batch_normalization_1 (Batch (None, 128)               512       
_________________________________________________________________
activation_11 (Activation)   (None, 128)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
embedding (Dense)            (None, 256)               33024     
_________________________________________________________________
batch_normalization_2 (Batch (None, 256)               1024      
_________________________________________________________________
activation_12 (Activation)   (None, 256)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 257       
_________________________________________________________________
batch_normalization_3 (Batch (None, 1)                 4         
_________________________________________________________________
activation_13 (Activation)   (None, 1)                 0         
=================================================================
Total params: 745,397
Trainable params: 743,069
Non-trainable params: 2,328
_________________________________________________________________
